const jokes = [
    "😂 برنامه نویس خواب نمیبینه، دیباگ میکنه!",
    "🤣 چرا برنامه نویس‌ها همیشه خسته‌اند؟ چون تا 3 صبح بیدار می‌مانند تا ساعت 12 بیدار شوند!",
    "😅 تفاوت بین برنامه نویس و خدا چیست؟ خدا فکر نمی‌کند که برنامه نویس است!",
    "😄 چند برنامه نویس لازم است تا یک لامپ را عوض کنند؟ هیچکدوم! این یک مشکل سخت‌افزاری است!",
    "🤪 یک برنامه نویس به دکتر می‌گوید: 'دکتر، من مشکل دارم!' دکتر می‌گوید: 'آره، باگ داری!'",
    "😆 چرا برنامه نویس‌ها هالووین را دوست دارند؟ چون می‌توانند مثل باگ‌ها لباس بپوشند!"
];

module.exports = (bot, users) => {
    bot.onText(/\/joke/, (msg) => {
        const joke = jokes[Math.floor(Math.random() * jokes.length)];
        bot.sendMessage(
            msg.chat.id,
            `${joke}`
        );
    });
};